In [1]:
import numpy as np
import pandas as pd

In [2]:
date = pd.read_csv('./orders.csv')
time = pd.read_csv('./messages.csv')

In [3]:
date.head(3)

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1

In [4]:
time.head(3)

                  date                                               msg
0  2013-12-15 00:50:00                          ищу на сегодня мужика 37
1  2014-04-29 23:40:00  ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00          Днепр.м 43 позн.с д/ж *.о  067.16.34.576

In [5]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [6]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

# ***Working with Dates***

In [7]:
# converting to datetime datetype
date['date'] = pd.to_datetime(date['date'])

In [8]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

# __1. Extract Year__

In [9]:
date['date_year'] = date['date'].dt.year

In [10]:
date.sample(3)

          date  product_id  city_id  orders  date_year
133 2018-07-23        6564       18       3       2018
511 2018-12-02        1403       29       3       2018
790 2019-11-02        6369       23       1       2019

# __2. Extract Month__

In [11]:
date['date_month_no'] = date['date'].dt.month

In [12]:
date.head(3)

        date  product_id  city_id  orders  date_year  date_month_no
0 2019-12-10        5628       25       3       2019             12
1 2018-08-15        3646       14     157       2018              8
2 2018-10-23        1859       25       1       2018             10

In [13]:
date['date_month_name'] = date['date'].dt.month_name()

In [14]:
date.head(3)

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name
0,2019-12-10,5628,25,3,2019,12,December
1,2018-08-15,3646,14,157,2018,8,August
2,2018-10-23,1859,25,1,2018,10,October

# __3. Extract Days__

In [15]:
date['date_day'] = date['date'].dt.day

In [16]:
date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day
0,2019-12-10,5628,25,3,2019,12,December,10
1,2018-08-15,3646,14,157,2018,8,August,15
2,2018-10-23,1859,25,1,2018,10,October,23
3,2019-08-17,7292,25,1,2019,8,August,17
4,2019-01-06,4344,25,3,2019,1,January,6

# __4. Extract Week__

In [17]:
date['days_of_week'] = date['date'].dt.dayofweek

In [18]:
date.head(3)

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day,days_of_week
0,2019-12-10,5628,25,3,2019,12,December,10,1
1,2018-08-15,3646,14,157,2018,8,August,15,2
2,2018-10-23,1859,25,1,2018,10,October,23,1

In [19]:
# day of week name
date['day_name'] = date['date'].dt.day_name()

In [20]:
date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day,days_of_week,day_name
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday

In [21]:
# is weekend?
date['date_is_weekend'] = np.where(date['day_name'].isin(['Sunday','Saturday']),1,0)

In [22]:
date.head(3)

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day,days_of_week,day_name,date_is_weekend
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday,0
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday,0
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday,0

In [23]:
# Extract week of the year
date['week_number'] = date['date'].dt.isocalendar().week
date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day,days_of_week,day_name,date_is_weekend,week_number
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday,0,50
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday,0,33
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday,0,43
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday,1,33
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday,1,1

In [25]:
# Extract Quarter
date['quarter'] = date['date'].dt.quarter

In [26]:
date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day,days_of_week,day_name,date_is_weekend,week_number,quarter
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday,0,50,4
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday,0,33,3
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday,0,43,4
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday,1,33,3
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday,1,1,1

In [27]:
date['semester'] = np.where(date['quarter'].isin([1,2]),1,2)

In [28]:
date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day,days_of_week,day_name,date_is_weekend,week_number,quarter,semester
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday,0,50,4,2
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday,0,33,3,2
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday,0,43,4,2
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday,1,33,3,2
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday,1,1,1,1

In [29]:
# Extract Time elapsed between dates
import datetime

today = datetime.datetime.today()

In [30]:
today

datetime.datetime(2024, 11, 28, 14, 27, 30, 896899)

In [31]:
today - date['date']

0     1815 days 14:27:30.896899
1     2297 days 14:27:30.896899
2     2228 days 14:27:30.896899
3     1930 days 14:27:30.896899
4     2153 days 14:27:30.896899
                 ...
995   2243 days 14:27:30.896899
996   2184 days 14:27:30.896899
997   2032 days 14:27:30.896899
998   2097 days 14:27:30.896899
999   1871 days 14:27:30.896899
Name: date, Length: 1000, dtype: timedelta64[ns]

In [32]:
(today - date['date']).dt.days

0      1815
1      2297
2      2228
3      1930
4      2153
       ...
995    2243
996    2184
997    2032
998    2097
999    1871
Name: date, Length: 1000, dtype: int64

In [35]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [36]:
# converting to detetime datatype
time['date'] = pd.to_datetime(time['date'])

In [37]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [38]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

In [39]:
# Extract Time part
time['time'] = time['date'].dt.time

time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

In [40]:
# Time difference
today - time['date']

0     4001 days 13:42:08.063846
1     3865 days 14:52:08.063846
2     4351 days 14:11:08.063846
3     3653 days 14:01:08.063846
4     4050 days 15:21:08.063846
                 ...
995   4640 days 13:42:08.063846
996   3961 days 15:18:08.063846
997   4426 days 14:55:08.063846
998   4542 days 14:58:08.063846
999   3814 days 15:07:08.063846
Name: date, Length: 1000, dtype: timedelta64[ns]

In [41]:
# in seconds
(today - time['date'])/np.timedelta64(1,'s')

0      3.457357e+08
1      3.339895e+08
2      3.759775e+08
3      3.156697e+08
4      3.499753e+08
           ...
995    4.009453e+08
996    3.422855e+08
997    3.824601e+08
998    3.924827e+08
999    3.295840e+08
Name: date, Length: 1000, dtype: float64

In [42]:
# in minutes
(today - time['date'])/np.timedelta64(1,'m')

0      5.762262e+06
1      5.566492e+06
2      6.266291e+06
3      5.261161e+06
4      5.832921e+06
           ...
995    6.682422e+06
996    5.704758e+06
997    6.374335e+06
998    6.541378e+06
999    5.493067e+06
Name: date, Length: 1000, dtype: float64

In [43]:
# in hours
(today - time['date'])/np.timedelta64(1,'h')

0       96037.702240
1       92774.868907
2      104438.185573
3       87686.018907
4       97215.352240
           ...
995    111373.702240
996     95079.302240
997    106238.918907
998    109022.968907
999     91551.118907
Name: date, Length: 1000, dtype: float64